cask_args appdir: '/Applications'

# Essentials:
brew 'fish'
brew 'wget'
brew 'git'
brew 'git-flow'
brew 'tmux'
brew 'pwgen'
brew 'wakeonlan'
brew 'ngrep'
brew 'httpie'

# Languages:
cask 'java'
brew 'node'
brew 'npm'
brew 'python3'

# Database support
brew 'postgresql'

# Essentials with GUI:
cask 'appcleaner'
cask 'docker'
cask 'vlc'
cask 'atom'
cask 'iterm2'
cask 'enpass'
cask 'little-snitch'
# Internet:
cask 'google-chrome'
cask 'firefox'
cask 'thunderbird'
cask 'skype'
cask 'adium'
cask 'filezilla'
cask 'owncloud'
# IDE:
cask 'phpstorm'
cask 'webstorm'
cask 'pycharm'
