cask_args appdir: '/Applications'

brew 'fish'
brew 'wget'
brew 'git'
brew 'tmux'
brew 'pwgen'
brew 'wakeonlan'
brew 'ngrep'
brew 'node'
brew 'npm'
brew 'httpie'
brew 'pass'
brew 'weechat'

cask 'appcleaner'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
brew 'docker'
brew 'docker-compose'
cask 'dockertoolbox'

cask 'vlc'
cask 'firefox'
cask 'thunderbird'
cask 'atom'
cask 'iterm2'
cask 'enpass'
cask 'skype'
cask 'java'
cask 'phpstorm'
cask 'webstorm'
cask 'intellij-idea'
cask 'eclipse-java'
cask 'caffeine'
cask 'little-snitch'
cask 'sequel-pro'
cask 'openoffice'
cask 'cyberduck'
cask 'filezilla'
cask 'google-chrome'
cask 'adium'
cask 'mactex'
cask 'texpad'
cask 'paw'
cask 'owncloud'
